{
"mamalia" : 
[
  
  {
    "id" : "1",
  "nama" : "Anjing",
  "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Keeshond_Sibirian_Husky_crossbreed_puppy.jpg/1200px-Keeshond_Sibirian_Husky_crossbreed_puppy.jpg?20080321140957",
 "namaLatin" : "Canis lupus familiaris",
  "status" : "Hewan Peliharaan",
  "jenisMakanan" : "Omnivora",
"jenisSpesies" : "Pomeranian, Poodle, Shih tzu, Chi hua hua, Maltese, Yorkshire (Yorkie), Pekingese, Beagle",
"pesebaran" : "Seluruh dunia", 
"makananKesukaan" : "Daging, Sayuran, Makanan Anjing",
"Deskripsi" : "Anjing adalah mamalia yang telah mengalami domestikasi dari serigala sejak 15.000 tahun yang lalu atau mungkin sudah sejak 100.000 tahun yang lalu berdasarkan bukti genetik berupa penemuan fosil dan tes DNA. Penelitian lain mengungkap sejarah domestikasi anjing yang belum begitu lama. Anjing adalah hewan sosial sama seperti halnya manusia. Kedekatan pola perilaku anjing dengan manusia menjadikan anjing bisa dilatih, diajak bermain, tinggal bersama manusia, dan diajak bersosialiasi dengan manusia dan anjing yang lain. Anjing memiliki kedudukan unik dalam hubungan antarspesies. Kesetiaan dan pengabdian yang ditunjukkan anjing paling mirip dengan pemikiran manusia mengenai cinta dan persahabatan. Walaupun sudah adalah naluri alami anjing sebagai hewan kelompokan, pemilik anjing paling menghargai kesetiaan dan pengabdian anjing dan mengasumsikannya sebagai anggota keluarga sendiri. Anjing kesayangan bahkan sering mencapai diberi nama keluarga yang sama seperti nama pemiliknya. Sebaliknya, anjing mengasumsikan manusia sebagai anggota kelompokannya. Anjing hanya sedikit membedakan kedudukan sang pemilik dengan rekan anjing yang masih satu kelompokan, dan bahkan sering tidak membedakannya sama sekali."
  }, 
  {
  "id" : "2",
  "nama" : "Berang-Berang",
  "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Lutra_lutra_1_-_Otter%2C_Owl%2C_and_Wildlife_Park.jpg/1200px-Lutra_lutra_1_-_Otter%2C_Owl%2C_and_Wildlife_Park.jpg?20070921052757",
  "namaLatin" : "Lutrinae",
  "status" : "Hewan Peliharaan/Hewan Jinak",
  "jenisMakanan" : "Karnivora",
"jenisSpesies" : "Berang-berang pantai, Berang-berang sumatra, Berang-berang kanada, Berang-berang amerika, Berang-berang neotropis, Berang-berang afrika, Berang-berang laut ",
"pesebaran" : "Seluruh Dunia kecuali Benua Australia", 
"makananKesukaan" : "Daging",
"Deskripsi" : "Berang-berang adalah salah satu jenis satwa unik dan bentuknya lucu. Hewan ini mempunyai ciri fisik yang seperti musang. Habitat hidupnya berada di dekat aliran sungai dan laut. Binatang ini tersebar hampir di seluruh dunia kecuali Benua Australia. Jenis berang-berang dibagi menjadi dua kelompok, yaitu Otter dan Beaver. Dari dua kelompok tersebut dibagi kembali menjadi 13 jenis. Di Indonesia hidup 4 jenis berang-berang dari total 13 jenis yang ada di dunia. 13 jenis tersebut masuk ke dalam beberapa genus yang berbeda-beda. Untuk spesies yang hidup di Indonesia berasal dari tiga genus, yaitu Lutra, Lutrogale, dan Aonyx. "
  },
  {
    "id" : "3",
    "nama" : "Kucing",
    "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Tabby_cat_with_blue_eyes-3336579.jpg/748px-Tabby_cat_with_blue_eyes-3336579.jpg?20180427181903",
    "namaLatin" : "Felis catus",
    "status" : "Hewan Peliharaan",
    "jenisMakanan" : "Karnivora",
  "jenisSpesies" : "Persia, Exotic Shorthair, Abyssinian, Burmese, Maine Coon, Russian Blue, Siamese, Ragdoll, Siberia, Siam, Bengal, British Shorthairs, Himalaya, Abyssinian, Scottish Fold, Sphynx",
  "pesebaran" : "Seluruh Dunia ", 
  "makananKesukaan" : "Daging, Ikan",
  "Deskripsi" : "Kucing adalah salah satu hewan peliharaan terpopuler di dunia. Kucing yang garis keturunannya tercatat secara resmi sebagai kucing trah atau galur murni (pure breed), seperti angora persia, siam, manx, sphinx. Kucing seperti ini biasanya dibiakkan di tempat pemeliharaan hewan resmi. Jumlah kucing ras hanyalah 1% dari seluruh kucing di dunia, sisanya adalah kucing dengan keturunan campuran seperti kucing liar atau kucing kampung Kucing dalam bahasa latinnya Felis silvestris catus, adalah sejenis karnivora. Kata 'kucing' biasanya merujuk kepada 'kucing' yang telah dijinakkan, tetapi bisa juga merujuk kepada 'kucing besar' seperti singa, harimau, dan macan. Kucing telah berbaur dengan kehidupan manusia paling tidak sejak 6.000 tahun SM, dari kerangka kucing di Pulau Siprus."
    }
  
],
  "aves" : 
[

  {
    "id" : "1",
      "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Burung_Kutilang.jpg/1200px-Burung_Kutilang.jpg?20190506061055",
      "nama" : " Cucak Kutilang",
     "namaLatin" : " Pycnonotus aurigaster",
      "status" : " Hewan Peliharaan",
      "jenisMakanan" : "Omnivora",
    "jenisSpesies" : " Kutilang jambul, Cucak kuning",
    "pesebaran" : " Seluruh Indonesia ", 
    "makananKesukaan" : "Serangga, ulat, biji-bijian, buah-buahan dan aneka hewan kecil ",
    "Deskripsi" : "cucak kutilang adalah jenis burung yang memiliki suara yang khas, hidup berkelompok, banyak dijumpai pada hutan-hutan sekunder, area terbuka, semak belukar dan padang rumput, serta pakannya dari jenis jenis serangga, ulat dan aneka hewan kecil lainnya. Cucak kutilang memiliki kebiasaan yaitu berjemur dan mandi embun untuk mempertahankan minyak pada bulunya"
      }, 
      {
        "id" : "2", 
         "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Bald.eagle.closeup.arp-sh.750pix.jpg/1200px-Bald.eagle.closeup.arp-sh.750pix.jpg?20070626160520",
          "nama" : "Elang",
         "namaLatin" : " Accipitridae",
          "status" : " Hewan Liar",
          "jenisMakanan" : " Karnivora",
        "jenisSpesies" : " Elang Hitam, Elang Brontok, Elang Bido, Elang Buteo, Elang Jawa, Elang Gunung, Elang Wallace, Elang Flores, Garuda, Elang Sulawesi, Elang Bondol, Elang Laut Perut Putih, Elang Ikan Kepala Abu, Elang Ikan kecil, Elang Tikus, Elang Perut Karat, Elang Paria, Elang Emas, Rajawali Kuskus, Rajawali Tutul, Elang Ular Jari pendek, elang laut steller ",
        "pesebaran" : "Seluruh Dunia  ", 
        "makananKesukaan" : " Daging  ",
        "Deskripsi" : "Elang adalah satwa pemangsa  yang memiliki ciri tubuh yang kekar, berbadan besar dan tentunya memiliki kekuatan yang ekstra. Dan yang paling menonjol dari burung jenis ini adalah paruhnya yang panjang dan kuat. Elang biasa menggunakan tipe habitat hutan alam dapat memenuhi kebutuhannya sumber pakan berupa satwa arboreal maupun terestrial yang berukuran kecil hingga sedang, maupun pohon mencuat/emergent untuk persarangannya. Elang berkembangbiak dengan cara bertelur  "
          },
          {
            "id" : "3",  
             "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Bald.eagle.closeup.arp-sh.750pix.jpg/1200px-Bald.eagle.closeup.arp-sh.750pix.jpg?20070626160520",
              "nama" : "Burung Cekakak",
             "namaLatin" : "Alcedoatthis",
              "status" : "Hewan Liar",
              "jenisMakanan" : "Karnivora",
            "jenisSpesies" : "Cekakak sungai, cekakak jawa, Cekakak batu, cekakak pita biasa",
            "pesebaran" : "Inggris bagian tengah dan selatan, Asia, Afrika, Oseania, dan negara tropis dan subtropis lainnya", 
            "makananKesukaan" : "Ikan",
            "Deskripsi" : "Burung cekakak adalah salah satu jenis burung yang memiliki warna bulu yang sangat cerah. Ciri-cirinya yaitu, kepala besar, paruh panjang, tajam, runcing, kaki pendek, dan ekor gemuk.  Habitat cekakak berada di lahan terbuka, pepohonan, yang dekat dengan sumber air bersih, tersebar sampai ketinggian 1.000 m dpl. "
              },
        {
          "id" : "4",  
        "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Just_a_barnyard_hen._%28Gallus_gallus_domesticus%29_%2811177385473%29.jpg/1200px-Just_a_barnyard_hen._%28Gallus_gallus_domesticus%29_%2811177385473%29.jpg?20180621112213",
          "nama" : "Ayam",
        "namaLatin" : "Gallus sp",
          "status" : "Hewan Ternak",
          "jenisMakanan" : "Omnivora",
        "jenisSpesies" : "Ayam kampung, ayam broiler, ayam petelur, ayam hutan hijau, ayam hutan merah, ayam hutan india, ayam pelung, ayam sentul, ayam hias",
        "pesebaran" : "Seluruh dunia", 
        "makananKesukaan" : "cacing dan buah-buahan",
        "Deskripsi" : "Ayam merupakan salah satu ternak perairan utama pada kehidupan manusia. Ayam (Gallus sp) termasuk kelas aves. Tubuhnya ditutupi bulu yang berfungsi sebagai pengatur suhu dan membantu pada saat terbang, memiliki dua pang ekstermis mempunyai sepasang anggota belakang yang maing-masing kaki berjari 4 serta di akhiri dengan cakar, serta mulutnya memilki paruh."
          },
    {
           "id" : "5",  
             "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Mandarin.duck.arp.jpg/1200px-Mandarin.duck.arp.jpg?20060222103815",
              "nama" : "itik",
             "namaLatin" : "Anatidae",
              "status" : "Hewan Ternak",
              "jenisMakanan" : "Omnivora",
            "jenisSpesies" : "bebek laut, angsa, angsa berleher pendek",
            "pesebaran" : "Seluruh dunia", 
            "makananKesukaan" : "ikan",
            "Deskripsi" : "itik merupakan unggas yang hidupnya di darat, pandai berenang, salah satu burung akuatik yang memiliki badan lebih kecil dari kerabatnya. Itik memiliki tubuh berlekuk dan lebar, serta memiliki paruh yang lebar. Itik termasuk binatang piaraan"
              }

], 
  "pisces" : 
[
  
  {
   "id" : "1",
  "nama" : "Mujair",
  "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Tilapia123.JPG/1200px-Tilapia123.JPG?20091025153749",
 "namaLatin" : "Oreochromis mossambicus",
  "status" : "Hewan Peliharaan",
  "jenisMakanan" : "Omnivora",
"jenisSpesies" : "Mujair Merah Nifi, Mujair Gesit, Mujair Lokal, Mujair Salina",
"pesebaran" : "Seluruh dunia", 
"makananKesukaan" : "Sayuran dan Daging kecil",
"Deskripsi" : "Ikan mujair berasal dari perairan Afrika, yaitu sekitar dataran rendah Zambezi, Shiré dan dataran pantai delta Zambezi sampai pantai Algoa. Pada saat ini, ikan mujair telah tersebar luas sekurang-kurangnya ke-90 negara di dunia, termasuk Indonesia. Ikan mujair diperkenalkan sebagai ikan budi daya atau ikan komersial dan di Indonesia, ikan Mujair awalnya diperkenalkan sebagai ikan hias. Ikan mujair dibedakan menjadi beberapa jenis, antara lain mujair biasa, mujair merah dan mujair albino. Berdasarkan warna sisik, ikan ini dapat dibedakan ke dalam lima varitas, yaitu mujair dengan warna sisik abu-abu, abu- abu bercak putih, putih, hitam dan merah. Ikan Mujair merupakan jenis ikan konsumsi air tawar, bentuk badan pipih dengan warna abu-abu, coklat atau hitam. Mujair memiliki bentuk badan yang pipih dan memanjang, bersisik kecil-kecil bertipe stenoid, tubuh memiliki garis vertikal, sirip ekor memiliki garis berwarna merah. Warna ikan ini tergantung pada lingkungan atau habitat yang di huni. Mulutnya agak besar dan mempunyai gigi-gigi yang halus. Letak mulut terminal atau di ujung tubuh. Posisi sirip perut terhadap sirip dada adalah thoracic. Linea lateralis tidak sempurna atau terputus menjadi dua bagian. Jumlah sisik pada garis rusuk bagian atas 18-21 buah dan pada garis rusuk bagian bawah ada 10-15 buah. Sirip dada dan sirip perut berwarna hitam kemerahan, sedangkan sirip punggung dan sirip ekor berwarna kemerah-merahan pada ujung-ujungnya ."
  }, 
  {
   "id" : "2",
  "nama" : "Tenggiri",
  "gambar" : "https://upload.wikimedia.org/wikipedia/commons/b/b2/Lanzardo_2.jpg?20171122021358",
  "namaLatin" : "Scomberomorini",
  "status" : "Hewan Liar",
  "jenisMakanan" : "Karnivora",
"jenisSpesies" : "Tenggiri Cina, Tenggiri Jepang, Tenggiri Korea, Tenggiri Papua, Tenggiri Cero ",
"pesebaran" : "Ikan tenggiri hidup di iklim tropis perairan laut. Di Indonesia, daerah persebarannya meliputi seluruh perairan Sumatera, Jawa, Nusa Tenggara, Kalimantan, Sulawesi, Maluku, dan Papua.", 
"makananKesukaan" : "Ikan-ikan kecil",
"Deskripsi" : "Ciri-ciri ikan tenggiri adalah mempunyai tubuh yang panjang, berbentuk torpedo dan merupakan perenang cepat. Tenggiri memiliki mulut yang lebar dengan ujung runcing, gigi pada rahang gepeng dan tajam. Mempunyai dua sirip punggung pertama berjari-jari keras 14-17 buah, sedangkan sirip punggung kedua berjari-jari lunak 14-19 buah yang diikuti 8-10 sirip tambahan (finlet). Sirip dubur berjari-jari lunak 17-18 buah yang diikuti 8-10 sirip tambahan. Garis rusuk lurus kemudian membengkok tajam di bawah jari-jari sirip tambahan dan melurus sampai batang ekor. Ikan tenggiri memiliki tubuh lunak tidak bersisik dan warna punggung kebiru-biruan tetapi perutnya berwarna perak."
  }
  
], 
  "amfibi" : 
[
  
  {
  "id" : "1",
  "nama" : "Katak",
  "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/The_Green_and_Golden_Bell_Frog.jpg/1200px-The_Green_and_Golden_Bell_Frog.jpg?20190526055537",
 "namaLatin" : "Anura",
  "status" : "Hewan Peliharaan dan Hewan Liar",
  "jenisMakanan" : "Karnivora",
"jenisSpesies" : "Katak Goliat, Paedophryne Amauensis, Katak Kaca, Katak Lumut, Katak Ungu, Katak Gurun Hujan, Katak Pinokio, Katak Pohon Monyet Lilin, Katak Sigung Venezuela ",
"pesebaran" : "Seluruh Dunia", 
"makananKesukaan" : "Serangga",
"Deskripsi" : "Anjing adalah mamalia yang telah mengalami domestikasi dari serigala sejak 15.000 tahun yang lalu atau mungkin sudah sejak 100.000 tahun yang lalu berdasarkan bukti genetik berupa penemuan fosil dan tes DNA. Penelitian lain mengungkap sejarah domestikasi anjing yang belum begitu lama. Anjing adalah hewan sosial sama seperti halnya manusia. Kedekatan pola perilaku anjing dengan manusia menjadikan anjing bisa dilatih, diajak bermain, tinggal bersama manusia, dan diajak bersosialiasi dengan manusia dan anjing yang lain. Anjing memiliki kedudukan unik dalam hubungan antarspesies. Kesetiaan dan pengabdian yang ditunjukkan anjing paling mirip dengan pemikiran manusia mengenai cinta dan persahabatan. Walaupun sudah adalah naluri alami anjing sebagai hewan kelompokan, pemilik anjing paling menghargai kesetiaan dan pengabdian anjing dan mengasumsikannya sebagai anggota keluarga sendiri. Anjing kesayangan bahkan sering mencapai diberi nama keluarga yang sama seperti nama pemiliknya. Sebaliknya, anjing mengasumsikan manusia sebagai anggota kelompokannya. Anjing hanya sedikit membedakan kedudukan sang pemilik dengan rekan anjing yang masih satu kelompokan, dan bahkan sering tidak membedakannya sama sekali."
  }, 
  {
  "id" : "2",
  "nama" : "Salamander",
  "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Axolotl2.jpg/1200px-Axolotl2.jpg?20210425213155",
  "namaLatin" : "Urodela",
  "status" : "Hewan Jinak/Hewan Liar",
  "jenisMakanan" : "Karnivora",
"jenisSpesies" : "Tiger Salamander, Fire Salamander, Red Salamander, Axolotl, Olm, California Newt.",
"pesebaran" : "Daerah terdekat Persebaran salamander adalah Vietnam, Laos dan Thailand Utara", 
"makananKesukaan" : "Serangga, Siput, Keong kecil, maupun Cacing.",
"Deskripsi" : "Salamander adalah nama umum untuk sekitar 550 spesies amfibi. Mereka secara umum dicirikan oleh penampilan mirip kadal, dengan tubuh ramping, hidung pendek, dan ekor yang panjang. Semua fosil dan spesisnya yang telah punah diisikan ke dalam ordo Caudata, sedangkan spesiesnya yang sedang benar digolongkan bersama ke dalam Urodela. Sebagian luhur salamander memiliki empat jari pada kaki hadapan mereka dan lima jari pada kaki balik mereka. Kulit mereka yang lembap menjadikan mereka bertambah suka tinggal di habitat di atau tidak jauh cairan, atau dalam tempat yang terlindung (misalnya tanah lembap), seringkali di lahan basah. Beberapa spesies Salamander sepenuhnya tinggal di cairan sepanjang hidup mereka, sebagian tinggal di cairan untuk sementara, dan sebagian lagi tinggal di darat ketika matang. Mereka makhluk vertebrata yang unik karena mereka bisa menumbuhkan kembali anggota tubuh yang hilang. "
  }
    
], 
  "reptil" : 
[
  
  {
    "id" : "1",  
     "gambar" : "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Snake_Burmese_Python.jpg/1200px-Snake_Burmese_Python.jpg?20181020095928",
      "nama" : "Ular Sanca",
     "namaLatin" : "Pythonidae",
      "status" : "Hewan liar",
      "jenisMakanan" : "karnivora",
    "jenisSpesies" : "Python anchietae, Python breitensteini, Python brongersmai, Python curtus, Python molurus, Python natalensis, Python regius, Python reticulatus, Python sebae, Python timoriensis",
    "pesebaran" : "Afrika, Australia, Amerika, Asia, termasuk Indonesia.", 
    "makananKesukaan" : "daging",
    "Deskripsi" : "Piton merupakan ular tidak berbisa dengan panjang antara 1,5 meter hingga 6,5 meter, sedangkan untuk beratnya 1 kg hingga 75 kg. Ular piton umumnya ditemukan di padang rumput, hutan tropis ataupun perairan air tawar. Tempat tinggal ular piton adalah kawasan hutan hujan tropis, sungai, hingga padang rumput."
      },
  {
  "id" : "2",
  "nama" : "Buaya",
  "gambar" : "https://upload.wikimedia.org/wikipedia/commons/7/78/Mugger_crocodile_2.JPG?20110824012841",
  "namaLatin" : "Crocodylidae",
  "status" : "Hewan Liar",
  "jenisMakanan" : "Karnivora",
"jenisSpesies" : "Buaya rawa, Gavial, Caiman hitam, Buaya Amerika, Buaya muara, Alligator Amerika, Buaya sungai Nil. ",
"pesebaran" : "Seluruh Dunia", 
"makananKesukaan" : "Daging",
"Deskripsi" : "Buaya adalah reptil bertubuh besar yang hidup di air. Secara ilmiah, buaya meliputi seluruh spesies anggota suku Crocodylidae, termasuk pula buaya ikan (Tomistoma schlegelii). Meski demikian nama ini dapat pula dikenakan secara longgar untuk menyebut ‘buaya’ aligator, kaiman dan gavial; yakni kerabat-kerabat buaya yang berlainan suku. Buaya umumnya menghuni habitat perairan tawar seperti sungai, danau, rawa dan lahan basah lainnya, namun ada pula yang hidup di air payau seperti buaya muara. Makanan utama buaya adalah hewan-hewan bertulang belakang seperti bangsa ikan, reptil dan mamalia, kadang-kadang juga memangsa moluska dan krustasea bergantung pada spesiesnya. Buaya merupakan hewan purba, yang hanya sedikit berubah karena evolusi semenjak zaman dinosaurus."
  }
  
]
}
